import {DataObj} from "../DataObj";
import {compareObjectsByTitle} from "../../utils";

const Azirbaizhan: Array<DataObj> = [
  {
    title: 'Азирбайджан',
    children: [
      {
        title: 'Азирбайджан',
        isMainArticle: true,
        content: [
          `Банановая Республика Азирбайджан - островное южное государство, расположенное на Обоссаном Острове. Правитель и основатель - Пиратор Азир.`,
          `Валюта: дристкоин`,
          `Государственная религия: отсутствует`,
          `<h6>Общая информация</h6>`,
          `Существование Азирбайджана было обнаружено Дристофором Красным Аналом, когда он отплыл далеко от берега континента и обнаружил на 
          горизонте Обоссаный Остров. Он смог выяснить у Азира, что тот основал Азирбайджан своими силами,
          а когда именно это произошло - он уже не помнит. Азир согласился на торговые отношения с Дристваром, ведь у него на острове присутствует
          вулканочька, регулярно извергающий ископаемые говны.`,
          `Кроме Азира, на острове живут только его резиновые куклы. Он находится с ними в теплых доверительных отношениях, и они исполняют роль его советниц,
          занимая должности в парламенте Азирбайджана.`,
          `<h6>Факты</h6>`,
          `Уровень коррупции в Азирбайджане равен 100% населения. Азир регулярно подкупает себя чтоб принимать решения, выгодные ему, а также
          по блату пропихнул своих кукол в свой парламент.`,
          `Азирбайджан является основным экспортером ископаемых говн в мире.`,
          `Кроме обычных ископаемых говн, вулканочька изредка извергает редкий минерал копросталь. По своей сути это те же ископаемые говны, только
          сталь из них получается высшего качества.`,
          `На Обоссаном Острове расположены тайные плантации брюквы, таинственного плода, найденного там Азиром. Именно он втайне поставляет брюкву
          на черные рынки всего мира и своему брату Брюкве.`,
        ]
      },
      {
        title: 'Пиратор Азир',
        content: [
          `Пиратор Азир - правитель и основатель Азирбайджана. Он император и он пират.`,
          `<h6>Ранние годы</h6>`,
          `Мало кто знает, что у членов экипажа Квадратного Очка Брямбы и Брюквы был брат по имени Азир. Пока Брямба интересовался оружием, а Брюква - готовкой,
          Азира интересовали только женщины. Они жили в курортном городе Каловы Вары, где постоянно были молодые занятые и не очень туристки, чьи
          сердца Азир покорял так же легко, как дышал.`,
          `Хоть он из заявлял каждой из своих любовниц, что она у него единственная, у него их были сотни, регулярных и не очень. Некоторые из них
          начинали что-то подозревать, и не всегда верили, когда он выкручивался. У него получалось оставаться безнаказанным, пока в Каловы Вары не прибыли
          представители СИМП с гуманитарной миссией. Они стали проводить открытые лекции для женщин, где рассказывали о том, как несправедливо к ним относятся
          везде кроме Пиздраиля, где женщины и мужчины живут в равенстве. На одном из собраний участницы, делившиеся историями о том, как их не уважали мужчины,
          обнаружили, что все их истории про одного и того же мужчину - Азира.`,
          `Однажды, покидая жилище очередной любовницы, Азир обнаружил, что за ним пришла толпа из пары сотен женщин. Он попытался выкрутиться, но они его не слушали.
          Его связали, избили и сдали представителям СИМП для отправки в Пиздраиль. Так как всем бывшим любовницам остопиздело плохое отношение к ним, они обозвали
          его Остопиздом.`,
          `<h6>Рабство</h6>`,
          `Остопизд, как и многие другие рабы, был выставлен на всеобщее пользование для желающих продлить свой род пиздраильтянок. К ужасу амандисток, 
          он героически пережил секс-марафон, да так, что многие из воспользовавшихся им женщин приходили к нему много раз, устраивая длинные очереди и битвы за право
          им воспользоваться.`,
          `Когда его выставили на продажу, боевым лезвиянкам пришлось усмирять бушующую толпу желающих его купить, ведь пиздраильтянки были готовы
          убивать за него. Он сам лично выбрал свою хозяйку из менее жирных и страшных. Несколько лет он жил с ней, быстро склонив её к нарушению запрета
          на половую связь с рабами, и добившись от неё отношения к себе получше чем у других рабов.`,
          `<h6>Побег Остопизда</h6>`,
          `В один момент ему остопиздело быть рабом. Он встал с кровати, переступил через спящую хозяйку, вышел из дома и пошел в направлении океана.
          Обеспокоенные гражданки вызвали лезвиянок, но они не устояли перед его мужеством и попадали в оргазмических конвульсиях. Остопизд без препятствий
          добрался до океана, прыгнул в воду и уплыл нахуй. Имя Остопизд стало значить революционера, которому остопиздело рабство.`,
          `Он плыл на запад, пока не обнаружил землю. После небольшого исследования, он понял, что это вулканический остров, отсутствуюший на картах океана, которые
          он видел ранее. Он назвал вулкан Вулканочькой, а остров - Обоссаным Островом, и образовал там свою банановую республику Азирбайджан, вернувшись к
          своему старому имени.`,
          `<h6>Правитель Азирбайджана</h6>`,
          `Азир обнаружил, что на островве есть богатые залежи ископаемых говн. Быстро вспомнив уроки каломантии из детства, он создал необходимое для жизни - 
          резиновых кукол. Лишившись риска умереть от одиночества и недоеба, он стал постепенно осваивать остров. Он нашел странные невиданные ранее плоды,
          которые были достаточно питательными и нравились ему по вкусу, и стал выращивать их на плантациях.`,
          `За много лет без общения с людьми, он начал говорить со своими куклами, после чего он устроил их в созданный парламент Азирбайджана, продвигая
          в своей республике кумовство. Он стал реализовывать коррумпированные схемы, подкупая самого себя ради направления развития государства в выгодном ему
          направлении.`,
          `Впервые за долгое время встретившись с людьми, когда на Обоссаный Остров случайно заплыл Дристофор Красный Анал, Азир с радостью согласился
          на торговые отношения с Дристваром. С удивлением он обнаружил в экипаже корабля Красного Анала своих братьев Брямбу и Брюкву. Когда он показывал им остров,
          Брюкву очень заинтересовали таинственные плоды, которые выращивал Азир, он стал их тайно у него закупать и готовить из них свою уникальную похлебку.
          Растение в итоге было названо в честь него брюквой.`,
        ]
      },
    ].sort(compareObjectsByTitle)
  },

];

export default Azirbaizhan;