import {DataObj} from "../DataObj";
import {compareObjectsByTitle, transliterateRus} from "../../utils";

const Extras: Array<DataObj> = [
  {
    title: 'Дополнительные материалы',
    children: [
      {
        title: 'Отрывок из "Пролетая над Гробницей Ануса"',
        content: [
          `Маккок наклонил ебало прямо ко мне, так что пришлось смотреть на него.`,
          `– Это верно? Ты дристварец, ученый?`,
          `– Он коренной дристварец.`,
          `Маккок собрал губы трубочкой и долго плевал мне в лицо. Потом выпрямился и протянул свой член.`,
          `– Какого Cралина, кок-то мне пожать он может? Хоть дристварец, хоть с Азирбайджана. Ей-богу, ученый, пускай ты говномес, но член мне пожмешь,
          или буду считать за оскорбление. А оскорблять нового завоебателя личной гвардии его величества Членина – не стоит.`,
          `Сказав это, он оглянулся на Дилдинга и Ебилли и скорчил ебало. Но кок его был по-прежнему протянут ко мне, большой, как пушки Брямбы.`,
          `Очень хорошо помню этот член: под залупой сажа – с тех пор как он работал в гараже; в серёдке – наколка, лик всемогущего Членина; 
          на одном яйце пластырь, отставший по краям. Кок покрыт шрамами и порезами, старыми, новыми. Помню, что кончик был ровный и твердый, как дерево, 
          от долгого трения об очко – не подумаешь, что член какого-нибудь дристварского матроса. Весь хуй был в мозолях, мозоли потрескались, 
          в трещины въелось гавно. Дорожная карта его странствий по анусам товарищей, другими словами. `,
          `Его член с шершавым звуком прикоснулся к моей руке. Помню, как он обвернулся и сжал мою руку, и с ней произошло что-то странное, 
          она стала разбухать, будто он вливал в нее свою кровь. В ней заиграла кровь и сила. Помню, она разрослась почти как его член...`,
          `<h6> </h6>`,
          `Отрывок из экзистенциального романа <a href="/${transliterateRus('Дриствар')}/${transliterateRus('У.Е.Бан')}">У.Е.Бана</a> 
            "Пролетая над Гробницей Ануса" о пребывании главного героя, 
            по происхождению <a href="/${transliterateRus('Дриствар')}/${transliterateRus('Королевство Дриствар')}">дристварца</a>, 
            в <a href="/${transliterateRus('Коково')}/${transliterateRus('Королевство Коково')}">Коково</a>.`,
        ]
      },
      {
        title: '100 дристварских говн',
        content: [
          `Сказка эта известна каждому ребенку в Дристваре: причиной тому может быть как пропаганда из-за напряженных отношений с Пиздраилем, 
          так и необычайная поучительность самой сказки.`,
          `Она повествует о дристварце Роджере Жеппклизме, у которого ожил его кал. Кал был умен и сообразителен, что среди его рода - большая редкость 
          (вспомнить хотя бы небезысвестных дерьмодемонов и говнодрищенских гномов с дристварских болот). Кал радел за своего хозяина и был влюбчив до невозможности: 
          он влюбился в комочек тины и гавнины, который увидел на руках у Ебны Мочяговны, когда Роджер сходил на сушу в Жепе в Области Жепы. Ебна Мочяговна хранила 
          свою тину-и-гавнину в память о Водоёбе, однажды заглянувшем в ее болото (разумеется, тот выебал всю воду в болоте, от чего из болота 
          сбежала вся ряска и тина, обретя сознание и поселившись у Ебны). Как заправский шахматист, Кал Роджера хитростью сводит его с Ебной, и вскоре те женятся.`,
          `У Кала и Тины-гавнины рождаются говны: говн много, и они резвятся, веселя жителей Жепы в области Жепы. Однако вскоре объявляется старая знакомая Ебны, 
          а также коллега по опасному бизнесу - Сруебла Де Бил. Эта пиздраильская шлюха была уже пробита насквозь, и именно потому искала новых экзотических членов 
          в Дристваре: превратно поняв обычаи местных жителей, она решила, что, вырядившись в шубу из говн, сможет переебать весь Дриствар 
          (или хотя бы заставить пару коковцев усомниться в своей ориентации). `,
          `Сруебла попыталась купить молодые говны у Роджера и Ебны, однако те отказались. Тогда госпожа Де Бил нанимает двух отбитых коковских диссидентов, 
          полностью лишенных мозга: Донго и Члэндди. Эти двое крадут говны и запирают в ссаной холупе на болотах, где те вынуждены были бы 
          ждать своей участи - если бы не их смекалка. Умело обводя вокруг носа коковцев, говны сбегают, а затем обматываются зловонными водорослями, 
          чтобы их спутали с болотной тиной. Однако случайный матрос, решивший жидко посрать с проходящего мимо корабля, смывает их маскировку, и коковцы почти настигают их.`,
          `Сказка оканчивается тем, что на помощь юным говнам приходит добродушный капитан болотного фрегата, весело подмигивающий и иногда задумчиво потирающий очко. 
          Сруебла же, пытаясь настигнуть несостоявшуюся шубу, тонет в потоке гавнины, которую как раз сливали за борт.`,
          `Сказка имеет множество вариаций: так, в Пиздраиле имеется близкая её вариация, в которой [вагинальные выделения, которые автор из приличия не станет приводить здесь] 
          выполняют ту же сюжетную роль, что и говны. Близким к Сруебле персонажем там является темная и непознавшая идеалов женского общества женщина-ретроградка, 
          которая, однако, в пиздраильском варианте не умирает в муках, а случайно выпивает вина с менструальной кровью и таким образом исправляется, 
          пересмотрев свои социальные убеждения.`,
          `Культуролухи Дриствара уже не одно столетие спорят о том, какой посыл несет в себе эта простая сказка: кто-то говорит, что она повествует о дружбе, 
          показанной сплоченной семьей говн; кто-то ищет в ней бесконечную сакрализацию говна, кто-то - социальное высказывание о том, что кал, 
          в общем-то, нужно почетать, но не творить из него идолы наподобие шубы. Автор данного исследования же придерживается мнения, основанного на 
          строгой статистике и фольклорных исследованиях - очевидно, сказка хочет поставить нас перед фактом: даже ожившее гавно способно перехитрить ебучих фемок.`,
          `<h6> </h6>`,
          `<a href="/${transliterateRus('Дриствар')}/${transliterateRus('У.Е.Бан')}">У.Е.Бан</a>, "Заметки о дристварском фольклоре".`,
        ]
      },
      {
        title: 'Правдивая история Говня Придристовича Сраного',
        content: [
          `Говень Придристович Сраный, проживавший в деревне Зеленые Говнецы со своей женой Говной Аналовной Сраной, с виду казался обычным дристварским обывателем. 
          Дни он проводил, черпая говно у стен королевского замка Дриствара, а ночи проводил с верой в Дристца и своей женой.`,
          `Жена его была прилежной домохозяйкой, уважаемой в деревне. Каждая женщина Зеленых Говнецов могла сказать с уверенностью, что Говна Аналовна - 
          образцовая гражданка Дриствара, и её вера в Дристца сильна, как молодое очко, сдерживающее дрист, чтоб случайно не обосраться не на людях. 
          Ничего не предвещало того, что произошло с этой образцовой Дристварской семьей.`,
          `Услышав их молитвы, Дристоц одарил их сыном. Узнав о беременности жены, Говень Придристович был счастлив настолько, что дристал 
          три дня и три ночи и обмазывал калом свою жену, дом и соседей во славу Дристца! Но когда сын таки родился, очевидцы были 
          шокированы тем, что они увидели: ребенок родился с залуповиной.`,
          `Отойдя от потрясения, акушеры все таки произвели обрезание, дабы закончить роды. Но у всех в головах крутился вопрос. Как образцовая дристварская 
          пара могла родить коковца? Говорят, что после выписки из родильного дома Говень Придристович закрылся в своем доме и 
          три дня и три ночи пил говновуху. Про семью начали ходить плохие слухи, якобы они тайно верят в семь залуп и насмехаются по ночам над 
          Дристцом, а в этой деревне вообще живут только чтоб выебать всех в очко и пустить кругом по себе.`,
          `На четвертый день после потрясения Говень Придристович появился на людях. Очевидцы заявляют, что не узнали в нем прежнего дристварца. 
          Он бегал по улицам в чем мать родила, размахивая членом, который был ОБРЕЗАН, и кричал что-то про залупы и некого Хер Мемуса. Мало кто смог выдержать 
          это зрелище. В народе пошло серьезное беспокойство о вторжении коковцев, но Говня Придристовича решили поначалу оставить в покое, списав все на стресс после проишествия.`,
          `Тем временем, в деревне начали происходить странные проишествия. Люди начали просыпаться по утрам с чувством, что их кто-то ебал в жопу, 
          рот и нос, но не могли вспомнить ничего. Так продолжалось, пока народ не собрал вооруженный патруль для поимки серийного маньяка. 
          Патруль на первом же патрулировании был пущен по кругу насильником, которым оказался ни кто иной, как Говень Придристович Сраный. Его посадили под стражу. 
          По последним известиям, каломанты продолжают проводить над ним экзорцизм, и неизвестно, выйдет ли им вернуть прежнего образцового 
          дристварца к вере в нашего единого бога Дристца.`,
          `<h6> </h6>`,
          `Заметка из дристварской газеты, за авторством известного дристварского журналиста под псевдонимом Алый Дрист`,
        ]
      },
    ].sort(compareObjectsByTitle)
  },

];

export default Extras;